rottenpotatoes-rails-intro/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" = 'G'  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R')  ORDER BY "movies"."release_date" ASC
---
  def index
    @all_ratings = Movie.all_ratings

    # Limpiar la sesión si la URL no contiene "movies"
    session.clear unless request.original_url.include?('movies')

    # Restaurar parámetros de sesión si no se proporcionan nuevos
    params[:ratings] ||= session[:ratings]
    params[:sort] ||= session[:sort]

    # Inicializar variables de instancia para las clases de columnas
    @sort_column_class_title = nil
    @sort_column_class_date = nil

    # Obtener las clasificaciones seleccionadas del formulario
    @ratings_to_show = params[:ratings]&.keys || []

    # Ordenar las películas
    @movies = Movie.with_ratings(@ratings_to_show)
    sort_column = params[:sort]

    case sort_column
    when 'name'
      @movies = @movies.order(:title)
      @sort_column_class_title = 'hilite p-3 mb-2 bg-warning text-dark'
    when 'date'
      @movies = @movies.order(:release_date)